//
// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

// let a = 5;
// let b = 8;
// let c = 10;
//
// function numbers() {
//     if (a < b && a < c) {
//         console.log(a);
//     } else if (b < a && b < c) {
//         console.log(b);
//     } else if (c < a && c < b) {
//         console.log(c);
//     }
// }
//
// numbers()


// -------------------------------------------------------------------------------------------------------------------




// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)


// let k = 18;
// let f = 35;
// let o = 20;
//
// function numbersTwo() {
//     if (k > f && k > o) {
//         console.log(k);
//     } else if (f > k && f > o) {
//         console.log(f);
//     } else if (o > k && o > f) {
//         console.log(o);
//     }
// }
//
// numbersTwo()





// --------------------------------------------------------------------------------------------------------------------------





// - створити функцію яка повертає найбільше число з масиву


//
// function namberMain(numbers) {
//     let more = numbers[0];
//     for (let number of numbers) {
//         if (number > more) {
//             more=number;
//         }
//     }
//     return more;
// }
//
// let num = namberMain([26, 48, 305, 256, 13, 12, 705, 406, 55, 100]);
// console.log(num);


// - створити функцію яка повертає найменьше число з масиву


// function elements(main) {
//     let min = main[0];
//     for (let number of main) {
//         if (number < min) {
//             min=number;
//         }
//     }
//     return min;
// }
//
// let mini = elements([3, 7, 14, 65, 2, 41, 25, 300, 11, 188]);
// console.log(mini);
//
//

// -----------------------------------------------------------------------------------------------------------------



// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13


// function number(all) {
//     let sum =all[0]+all[1]+all[2]+all[3]+all[4]+all[5];
//     return sum;
// }
//
// let number1 = number([12, 14, 34, 18, 74, 66]);
// console.log(number1);
//

// ---------------------------------------------------------------------------------------------------------------------



// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.


// function number(array) {
//         let sum = 0;
//     for (let k = 0; k < array.length; k++) {
//         sum = array[k] + sum;
//         average = sum / array.length;
//     }
//     return average;
// }
//
// let number1 = number([3, 4, 8, 6, 5]);
// console.log(number1);



// ------------------------------------------------------------------------------------------------------------------------------



// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

// function numbers() {
//     let min = arguments[0];
//     let max = arguments[0];
//     for (let lenght of arguments) {
//         if (arguments.length <= 4 && lenght>max) {
//             max = lenght;
//             console.log(max);
//         } else if (arguments.length > 4 && lenght<min) {
//             min = lenght;
//         }
//     }
//     return min;
// }
//
// let numbers1 = numbers(40, 50, 10, 100,200);
// console.log(numbers1);
// numbers(30, 20, 80,50);
// numbers(30, 20);



// -----------------------------------------------------------------------------------------------------------------------------------------


// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.

// let array = [];
//
// function mainArray(size) {
//     for (let i = 0; i < 50; i++) {
//         size[i]=Math.round(Math.random() * 100);
//     }
//     return size;
// }
//
// console.log(mainArray(array));




// ----------------------------------------------------------------------------------------------------------------------------




// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.

// let array = [];
//
// function mainArray(size,limit) {
//     for (let i = 0; i < 20; i++) {
//         size[i]=Math.round(Math.random() * limit);
//     }
//     return size;
// }
//
// console.log(mainArray(array, 50));
//
//




// --------------------------------------------------------------------------------------------------------------------------------------------------




// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
//
// let array = [22,33,44,55,66,77];
//
// function mainArray(arguments) {
//     for (let i = arguments.length - 1; i >= 0; i--) {
//          arg = arguments[i];
//         array.push(arg);
//     }
//     return array;
// }
//
// console.log(mainArray(array));
//

// -----------------------------------------------------------------------------------------------------------------