//
//
// // - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
//
//
// function square(a, b) {
//     let S = a * b;
//     return S;
// }
//
// let square1 = square(20, 10);
// console.log(square1);
//
//
//
// // ---------------------------------------------------------------------------------------------------------
//
//
//
// // - створити функцію яка обчислює та повертає площу кола з радіусом r
//
// function round(r,pi) {
//     let squareRound = (r**2) * pi;
//     return squareRound;
// }
//
// let round1 = round(7, 3.14);
// console.log(round1);
//
//
//
//
// // --------------------------------------------------------------------------------------------------------------
//
//
//
// // - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
//
// function cylinder(pi, r, h) {
//     let cylinderArea = 2 * pi * r * h;
//     return cylinderArea;
// }
//
// let cylinder1 = cylinder(3.14, 8, 14);
// console.log(cylinder1);
//
//
//
//
// // ------------------------------------------------------------------------------------------------------------------------
//
//
// // - створити функцію яка приймає масив та виводить кожен його елемент
//
// let massivOne = [2, 4, 6, 8, 3, 7, 1];
// function massiv(massivOne) {
//     for (k = 0; k < massivOne.length; k++) {
//         console.log(massivOne[k])
//     }
// }
// massiv(massivOne);
//
//
// // ------------------------------------------------------------------------------------------------------------------------
//
//
//
//
// // - створити функцію яка створює параграф з текстом. Текст задати через аргумент
//
//
// function paragraf(p) {
//     document.write(`<p>${p}</p>`);
// }
// paragraf('New York is the moder city');
//

// --------------------------------------------------------------------------------------------------------------------------




// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

//
// function list(numberNew) {
//     document.write(`<ul>`);
//     for (let l = 0; l < numberNew; l++) {
//         document.write(`<li>New York is the moder city<li>`);
//     }
//     document.write(`</ul>`);
// }
//
// list(3);
//



// ------------------------------------------------------------------------------------------------------------------------------




// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)


//    function list(description,number) {
//     document.write(`<ul>`);
//     for (let l = 1; l < number; l++) {
//         document.write(`<li>description ${l}<li>`);
//     }
//     document.write(`</ul>`);
// }
//
// list(`New York is the moder city`,4);
//



// ---------------------------------------------------------------------------------------------------------------------------------------



// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// let elements = [2,true,'France',4,'Ukraine',8,false,3,'USA',9,false,4,'England',21];
//
// function dataArray(element) {
//     document.write(`<ul>`);
//     for (let i = 0; i < element.length; i++) {
//         document.write(`<li>${element[i]}</li>`)
//     }
//     document.write(`</ul>`);
// }
//
// dataArray(elements);
//
//

// ------------------------------------------------------------------------------------------------------------------------------------------



//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age, та виводить їх в документ. Для кожного об'єкту окремий блок.


// let list = [
//     {
//         id: 1767,
//         name: 'John',
//         age: 26
//     },
//     {
//         id: 2667,
//         name: 'Nick',
//         age: 25
//     },
//     {
//         id: 3646,
//         name: 'Joe',
//         age: 35
//     },
//     {
//         id: 6946,
//         name: 'Ann',
//         age: 45
//     },
//     {
//         id: 8786,
//         name: 'Bill',
//         age: 56
//     },
//     {
//         id: 5746,
//         name: 'Alan',
//         age: 19
//     },
//     {
//         id: 4528,
//         name: 'Linkoln',
//         age: 87
//     }
//
// ];
//
// function block (mainList) {
//     document.write(`<div>`);
//     for (let info of mainList) {
//         document.write(`<div>${info.id}</div>`);
//         document.write(`<div>${info.name}</div>`);
//         document.write(`<div>${info.age}</div><hr>`);
//     }
//     document.write(`</div>`);
// }
//
// block(list);



