// - Дано натуральное число n. Выведите все числа от 1 до n.

// ------------СПРОБА РЕКУРСІЄЮ-------------------------------

// function rec(i,n) {
//     i++;
//     console.log(i);
//     if (i === n) {
//         return;
//     }
//     rec(i,n);
// }
// rec(0,5);

// -------------СПРОБА ЦИКЛОМ-------------------------------------
//
// let number = (n)=>{
//     for (let k = 1; k < n; k++) {
//         console.log(k)
//     }
// }
// number(5);
//


// --------------------------------------------------------------------------------------------------------------------------


// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// let numbers = (A, B) => {
//     for (let i = A; i <= B; i++) {
//         console.log(i);
//         document.write(`<div>${i}</div><hr>`)
//     } if (A < B) {
//         for (let i = B; i >= A; i--) {
//             console.log(i);
//             document.write(`<div>${i}</div>`)
//         }
//     }
// };
// numbers(2, 8);
//


// ----------------------------------------------------------------------------------------------------------------------------


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//


// let array = (arrayTwo, number) => {
//     for (let i = number; i < number+1; i++) {
//         let num = arrayTwo[i];
//         if (arrayTwo[i] > arrayTwo[i+1] || arrayTwo[i] < arrayTwo[i + 1]) {
//             arrayTwo[i] = arrayTwo[i+1];
//             arrayTwo[i+1] = num;
//             console.log(arrayTwo);
//         }
//     }
//
//     return arrayTwo
// }
// array([9, 8, 0, 4], 0);
// array([9,8,0,4], 1);
// array([9, 8, 0, 4], 2);


// --------------------------------------------------------------------------------------------------------------------------



// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

